| Heading | Information |
|-|-|
| Author | Ja`Mone Bridges |
| Course | Data Science Bootcamp |
| Subject | Sprint 2 |
| Project | Economic Indicators |

### Introduction: This notebook is the ETL and EDA. The dataset use to determine if a leading indicator can be found for the US economy.  An indicated downturn would allow organizations, businesses, and individuals to make preparations to protect there interest. This may lead to a shallower downturn in the business cycle.  In a downturn, when the indicator point towards a upturn will allow the same group to start looking for opportunities for growth.

### In this first section, I check for the date range, date frequency, and features of the individual datasets.  Because some of the dataset are to large to work on in Pandas I stored them all in a database.

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
def cprt(df):
    display('Shape: ' + str(df.shape))
    print("Head")
    display(df.head())
    print('Tail')
    display(df.tail())

### Load the connection for the database and perform a SQL to extra the desired data.  First, we will take a look at inflation (cpi index)

In [3]:
# Engine required to read or store data in a mysql database.
db_engine = create_engine(
    "mysql://{user}:{pw}@localhost/{db}"
    .format(user="root",
    pw="rootroot",
    db="capstone"))


load_sql = 'SELECT * FROM capstone.cpi'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (196861, 4)'

Head

           series_id  year period  value
0  APU0000701111      1995    M01  0.238
1  APU0000701111      1995    M02  0.242
2  APU0000701111      1995    M03  0.242
3  APU0000701111      1995    M04  0.236
4  APU0000701111      1995    M05  0.244

Tail

                series_id  year period  value
196856  APUS49G7471A       2023    M05  3.965
196857  APUS49G7471A       2023    M06  4.107
196858  APUS49G7471A       2023    M07  4.353
196859  APUS49G7471A       2023    M08  4.567
196860  APUS49G7471A       2023    M09  4.719

#### The start year of 1995 is not enough history to be usable. Some dataset start from 1948 and the requirements for Machine Learning and Neural Network can not accommodate gap between 1948 and 1995.  The data is likely available back to 1945, however adjusting dollars to present day is an involved and complex task. I have determined it is best to drop this dataset.

Checking for period/frequency and location/resolution.
CPI Period: Monthly
Other tables must be checked for location/resolution.

In [4]:
load_sql = 'SELECT * FROM capstone.cpi_area'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (74, 2)'

Head

  area_code          area_name
0      0000  U.S. city average
1      0100          Northeast
2      0110        New England
3      0120    Middle Atlantic
4      0200            Midwest

Tail

   area_code                             area_name
69      S49C  Riverside-San Bernardino-Ontario, CA
70      S49D            Seattle-Tacoma-Bellevue WA
71      S49E                San Diego-Carlsbad, CA
72      S49F                          Urban Hawaii
73      S49G                          Urban Alaska

The CPI resolution is Metropolitan and region.

#### Household Assets will be loaded next to check suitability.

In [5]:
load_sql = 'SELECT * FROM capstone.household_assets'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (286, 6)'

Head

,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter,datetime
0,152300438,755.30,172427752,855.12,Q2,2023-06-30
1,146639645,737.62,166598374,838.01,Q1,2023-03-31
2,143655328,749.05,163579607,852.94,Q4,2022-12-03
3,142823794,756.41,162526658,860.76,Q3,2022-09-30
4,146312369,790.80,165688078,895.52,Q2,2022-06-30

Tail

,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter,datetime
281,1348617,512.84,1448824,550.95,Q1,1953-03-31
282,1338242,516.89,1436132,554.70,Q4,1952-12-03
283,1334038,527.17,1427479,564.09,Q3,1952-09-30
284,1321033,536.03,1411444,572.72,Q2,1952-06-30
285,1298464,533.45,1384688,568.88,Q1,1952-03-31

#### Household asset starts in the year 1952.  The dollars are unadjusted.  The date frequency is quarterly. This dataset will be used as a feature.

#### Household Economic by County will be loaded next to check for suitability.

In [6]:
load_sql = 'SELECT * FROM capstone.household_economic_by_county'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (240591, 61)'

Head

,GeoFIPS,GeoName,Region,TableName,LineCode,IndustryClassification,Description,Unit,1969,1970,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,02000,Alaska,8,CAINC30,10.0,...,Personal income (thousands of dollars),Thousands of dollars,1575306,1798953,...,39265976,38978032,41209955,42555117,41837407,42431384,43981166,45056762,45965064,48219215
1,02000,Alaska,8,CAINC30,45.0,...,Net earnings by place of residence,Thousands of dollars,1316736,1472142,...,26752593,26546688,27271983,28045644,27332294,27406404,28270188,28744975,28369134,29677492
2,02000,Alaska,8,CAINC30,50.0,...,Personal current transfer receipts,Thousands of dollars,52790,71873,...,5402297,5413593,6480108,6638900,6559186,6976720,7559816,7948319,9370692,10273193
3,02000,Alaska,8,CAINC30,60.0,...,Income maintenance benefits 1/,Thousands of dollars,9079,16997,...,837990,842011,851884,775954,734701,765328,750013,767625,855674,1155940
4,02000,Alaska,8,CAINC30,70.0,...,Unemployment insurance compensation,Thousands of dollars,9165,13465,...,232628,197828,115822,96084,110471,94828,77212,77924,901067,480425

Tail

,GeoFIPS,GeoName,Region,TableName,LineCode,IndustryClassification,Description,Unit,1969,1970,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
240586,98000,Far West,8,CAINC30,270.0,...,Farm proprietors employment 6/,Number of jobs,150788,149342,...,138301,139622,137612,137750,135901,134831,133433,133776,133341,132712
240587,98000,Far West,8,CAINC30,280.0,...,Nonfarm proprietors employment,Number of jobs,1438363,1473846,...,6699338,6895632,7136455,7391202,7518539,7665595,7887003,7662627,8002469,8221306
240588,98000,Far West,8,CAINC30,290.0,...,Average earnings per job (dollars),Dollars,8044,8468,...,61230,61744,63146,65121,66420,68831,70987,74129,79536,84302
240589,98000,Far West,8,CAINC30,300.0,...,Average wages and salaries,Dollars,7187,7615,...,54758,55106,56853,59226,60573,63290,65807,68518,75704,81239
240590,98000,Far West,8,CAINC30,310.0,...,Average nonfarm proprietors' income,Dollars,7216,7201,...,37835,37052,36527,36406,37303,37715,38141,40442,38931,40574

#### This dataset starts in the year of 1969.  It fall short of 1948 to 1952. The cost of using this dataset will leave out at least 3 downturns in the business cycle.  The data frequency is annual which cause a mismatch on the timeline but can be corrected.  The dataset would have to be adjusted so that each county is a feature. Part of the dataset must be transposed to match the other datasets.  While this is likely a beneficial dataset if it started in 1948 to 1952, I can not use it. I could not find a dataset that goes back 1948. It is likely the data collection started in 1969.

#### Household income by industry will be loaded next to check for suitability.

In [7]:
load_sql = 'SELECT * FROM capstone.household_income_naics'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (918323, 29)'

Head

,GeoFIPS,GeoName,Region,TableName,LineCode,IndustryClassification,Description,Unit,2001,2002,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,02000,Alaska,8,CAINC6N,1.0,...,Compensation of employees (thousands of dollar...,Thousands of dollars,14887161,15706888,...,25735371,26358319,27135635,27821562,27192776,27155424,28302312,29027998,28407241,29721935
1,02000,Alaska,8,CAINC6N,5.0,...,Wages and salaries,Thousands of dollars,11733847,12324298,...,19588221,19949098,20515254,21225799,20517759,20396696,21056706,21846142,21560474,22478810
2,02000,Alaska,8,CAINC6N,6.0,...,Supplements to wages and salaries,Thousands of dollars,3153314,3382590,...,6147150,6409221,6620381,6595763,6675017,6758728,7245606,7181856,6846767,7243125
3,02000,Alaska,8,CAINC6N,7.0,...,Employer contributions for employee pension ...,Thousands of dollars,2255768,2440345,...,4595889,4804301,5052669,5018706,5163569,5249141,5718361,5618043,5289095,5597548
4,02000,Alaska,8,CAINC6N,8.0,...,Employer contributions for government social...,Thousands of dollars,897546,942245,...,1551261,1604920,1567712,1577057,1511448,1509587,1527245,1563813,1557672,1645577

Tail

,GeoFIPS,GeoName,Region,TableName,LineCode,IndustryClassification,Description,Unit,2001,2002,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
918318,98000,Far West,8,CAINC6N,2001.0,...,Federal civilian,Thousands of dollars,26900660,28803613,...,43050337,42178471,43309310,44998732,46559555,47976540,49986490,51238602,54151286,55335143
918319,98000,Far West,8,CAINC6N,2002.0,...,Military,Thousands of dollars,14928311,17094614,...,31289304,30212278,29559304,29474627,29841214,30827565,29196189,29752444,31507300,33935295
918320,98000,Far West,8,CAINC6N,2010.0,...,State and local,Thousands of dollars,168388579,179263122,...,248534082,261701302,275236061,289765740,304652747,315467385,326879757,339944591,352064176,364584553
918321,98000,Far West,8,CAINC6N,2011.0,...,State government,Thousands of dollars,43656309,46500702,...,67966496,71942011,75909500,78914187,80207547,83375308,87035020,91750447,97127450,100825533
918322,98000,Far West,8,CAINC6N,2012.0,...,Local government,Thousands of dollars,124732270,132762420,...,180567586,189759291,199326561,210851553,224445200,232092077,239844737,248194144,254936726,263759020

#### This dataset poses the same problems as Household Economic by County. The dataset start in the year 2001 and makes it unusable with the dataset from 1948 and 1952.

#### Industry by County will be loaded next to check for suitability.

In [8]:
load_sql = 'SELECT * FROM capstone.industry_by_county LIMIT 100' # 58,420,878 Rows
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (100, 24)'

Head

,fipstate,fipscty,naics,empflag,emp,qp1,ap,est,n1_4,n5_9,...,n250_499,n500_999,n1000,n1000_1,n1000_2,n1000_3,n1000_4,censtate,cencty,year
0,1,1,------,-1,9115,48004,196839,769,417,163,...,1,2,0,0,0,0,0,63,1,2000
1,1,1,11----,-1,36,226,880,9,6,2,...,0,0,0,0,0,0,0,63,1,2000
2,1,1,113///,-1,11,57,223,4,3,1,...,0,0,0,0,0,0,0,63,1,2000
3,1,1,1131//,A,0,0,0,1,1,0,...,0,0,0,0,0,0,0,63,1,2000
4,1,1,11311/,A,0,0,0,1,1,0,...,0,0,0,0,0,0,0,63,1,2000

Tail

,fipstate,fipscty,naics,empflag,emp,qp1,ap,est,n1_4,n5_9,...,n250_499,n500_999,n1000,n1000_1,n1000_2,n1000_3,n1000_4,censtate,cencty,year
95,1,1,311///,A,0,0,0,1,0,1,...,0,0,0,0,0,0,0,63,1,2000
96,1,1,3116//,A,0,0,0,1,0,1,...,0,0,0,0,0,0,0,63,1,2000
97,1,1,31161/,A,0,0,0,1,0,1,...,0,0,0,0,0,0,0,63,1,2000
98,1,1,311612,A,0,0,0,1,0,1,...,0,0,0,0,0,0,0,63,1,2000
99,1,1,313///,C,0,0,0,2,1,0,...,0,0,0,0,0,0,0,63,1,2000

#### This data set poses a number of challenges.  It uses bucket for the number of employees for industry in a county. The data frequency is annual. Once employees start to get laid off the downturn is already in progress.  This may help determine if a upturn is going to happen because industries are investing in hiring employees. The dataset is large at 58 million rows.  This dataset might be used.

#### Industry by zip code will be loaded next to check for suitability.

In [9]:
load_sql = 'SELECT * FROM capstone.industry_by_county_zip_code_detail LIMIT 100' # 112,829,499 Rows
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (100, 13)'

Head

,zip,naics,est,n1_4,n5_9,n10_19,n20_49,n50_99,n100_249,n250_499,n500_999,n1000,year
0,501,------,1,1,0,0,0,0,0,0,0,0,2000
1,501,62----,1,1,0,0,0,0,0,0,0,0,2000
2,501,621910,1,1,0,0,0,0,0,0,0,0,2000
3,1001,------,493,235,96,76,46,23,15,2,0,0,2000
4,1001,22----,1,1,0,0,0,0,0,0,0,0,2000

Tail

,zip,naics,est,n1_4,n5_9,n10_19,n20_49,n50_99,n100_249,n250_499,n500_999,n1000,year
95,1001,446199,1,0,0,1,0,0,0,0,0,0,2000
96,1001,447110,2,0,2,0,0,0,0,0,0,0,2000
97,1001,447190,5,2,2,1,0,0,0,0,0,0,2000
98,1001,448120,1,0,1,0,0,0,0,0,0,0,2000
99,1001,448210,2,2,0,0,0,0,0,0,0,0,2000

#### This dataset is the same as the county above but in greater detail.  This is too much detail to be useful and will add considerable resources to train.  This dataset will not be used.

#### Labor Force Size by Month will be loaded next to check for suitability.

In [10]:
load_sql = 'SELECT * FROM capstone.labor_force_size_by_month'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (5637592, 5)'

Head

              series_id  year period  value footnote_code
0  LAUCN010010000000003  1990    M01    6.5
1  LAUCN010010000000003  1990    M02    6.5
2  LAUCN010010000000003  1990    M03    5.7
3  LAUCN010010000000003  1990    M04    6.6
4  LAUCN010010000000003  1990    M05    6.0

Tail

                    series_id  year period    value footnote_code
5637587  LAUCN721530000000006  2023    M05  10298.0
5637588  LAUCN721530000000006  2023    M06  10138.0
5637589  LAUCN721530000000006  2023    M07  10320.0
5637590  LAUCN721530000000006  2023    M08  10437.0
5637591  LAUCN721530000000006  2023    M09  10533.0             P

#### The dataset starts in the year 1990. I have a dataset that goes back to 1948 that will be used instead.  This dataset and the next two related datasets will not be used.

#### The following dataset is not used.

In [11]:
load_sql = 'SELECT * FROM capstone.labor_force_series'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (34105, 12)'

Head

,series_id,area_type_code,area_code,measure_code,seasonal,srd_code,series_title,footnote_codes,begin_year,begin_period,end_year,end_period
0,LASBS060000000000003,L,BS0600000000000,03,S,06,"Unemployment Rate: Balance of California, stat...",1976,M01,2023,M09,-1
1,LASBS060000000000004,L,BS0600000000000,04,S,06,"Unemployment: Balance of California, state les...",1976,M01,2023,M09,-1
2,LASBS060000000000005,L,BS0600000000000,05,S,06,"Employment: Balance of California, state less ...",1976,M01,2023,M09,-1
3,LASBS060000000000006,L,BS0600000000000,06,S,06,"Labor Force: Balance of California, state less...",1976,M01,2023,M09,-1
4,LASBS120000000000003,L,BS1200000000000,03,S,12,"Unemployment Rate: Balance of Florida, state l...",1990,M01,2023,M09,-1

Tail

,series_id,area_type_code,area_code,measure_code,seasonal,srd_code,series_title,footnote_codes,begin_year,begin_period,end_year,end_period
34100,LAUST560000000000009,A,ST5600000000000,09,U,56,Civilian Noninstitutional Population: Wyoming (U),1976,M01,2023,M09,-1
34101,LAUST720000000000003,A,ST7200000000000,03,U,72,Unemployment Rate: Puerto Rico (U),1976,M01,2023,M09,-1
34102,LAUST720000000000004,A,ST7200000000000,04,U,72,Unemployment: Puerto Rico (U),1976,M01,2023,M09,-1
34103,LAUST720000000000005,A,ST7200000000000,05,U,72,Employment: Puerto Rico (U),1976,M01,2023,M09,-1
34104,LAUST720000000000006,A,ST7200000000000,06,U,72,Labor Force: Puerto Rico (U),1976,M01,2023,M09,-1

#### The following dataset is not used.

In [12]:
load_sql = 'SELECT * FROM capstone.labor_force_size_by_year'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (106186, 9)'

Head

,laus_code,state_fips,county_fips,county_and_state,year,labor_force,employed,unemployed_level,unemployed_rate
0,CN0100100000000,01,001,"Autauga County, AL",2000,"21,861","20,971",890,4.1
1,CN0100300000000,01,003,"Baldwin County, AL",2000,"69,979","67,370","2,609",3.7
2,CN0100500000000,01,005,"Barbour County, AL",2000,"11,449","10,812",637,5.6
3,CN0100700000000,01,007,"Bibb County, AL",2000,"8,623","8,160",463,5.4
4,CN0100900000000,01,009,"Blount County, AL",2000,"25,266","24,375",891,3.5

Tail

,laus_code,state_fips,county_fips,county_and_state,year,labor_force,employed,unemployed_level,unemployed_rate
106181,CN7214500000000,72,145,"Vega Baja Municipio, PR",1999,"19,705","17,046","2,659",13.5
106182,CN7214700000000,72,147,"Vieques Municipio, PR",1999,"2,662","2,310",352,13.2
106183,CN7214900000000,72,149,"Villalba Municipio, PR",1999,"6,143","5,018","1,125",18.3
106184,CN7215100000000,72,151,"Yabucoa Municipio, PR",1999,"12,428","10,158","2,270",18.3
106185,CN7215300000000,72,153,"Yauco Municipio, PR",1999,"13,706","11,408","2,298",16.8

#### US National Debt will be loaded next to check for suitability.

In [13]:
load_sql = 'SELECT * FROM capstone.national_debt'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (11236, 6)'

Head

,Debt Held by the Public,Intragovernmental Holdings,Total Public Debt Outstanding,Calendar Year,Calendar Month Number,Calendar Day Number
0,NaN,NaN,4.225874e+12,1993,4,1
1,NaN,NaN,4.233931e+12,1993,4,2
2,NaN,NaN,4.234253e+12,1993,4,3
3,NaN,NaN,4.234575e+12,1993,4,4
4,NaN,NaN,4.234896e+12,1993,4,5

Tail

,Debt Held by the Public,Intragovernmental Holdings,Total Public Debt Outstanding,Calendar Year,Calendar Month Number,Calendar Day Number
11231,2.695243e+13,7.043385e+12,3.399581e+13,2023,12,31
11232,2.695938e+13,7.033589e+12,3.399297e+13,2024,1,1
11233,2.696633e+13,7.023794e+12,3.399013e+13,2024,1,2
11234,2.696795e+13,7.026266e+12,3.399422e+13,2024,1,3
11235,2.697693e+13,7.029342e+12,3.400627e+13,2024,1,4

#### The USA national debt is given daily starting 1993.  While national debt is interesting to view it is not as powerful as knowing the amount of government spending.  It gives the amount above the allocated budget from one year to the next.  Also, it shows the accumulated amount over all the budgets less any debt paid off. This dataset is not going to be used.

#### Personal Income will be loaded next to check for suitability.

In [14]:
load_sql = 'SELECT * FROM capstone.personal_income_monthly'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (33406, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,T20600,A065RC,1,Personal income,1959M01,Current Dollars,Level,6,391771.0,T20600
1,T20600,A065RC,1,Personal income,1959M02,Current Dollars,Level,6,393682.0,T20600
2,T20600,A065RC,1,Personal income,1959M03,Current Dollars,Level,6,396493.0,T20600
3,T20600,A065RC,1,Personal income,1959M04,Current Dollars,Level,6,399871.0,T20600
4,T20600,A065RC,1,Personal income,1959M05,Current Dollars,Level,6,402407.0,T20600

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
33401,T20600,A067RM,43,"Disposable personal income, chained (2017) dol...",2023M09,Chained Dollars,Percent change,0,-0.1,T20600
33402,T20600,A067RM,43,"Disposable personal income, chained (2017) dol...",2023M10,Chained Dollars,Percent change,0,0.3,T20600
33403,T20600,A067RM,43,"Disposable personal income, chained (2017) dol...",2023M11,Chained Dollars,Percent change,0,0.4,T20600
33404,T20600,A067RM,43,"Disposable personal income, chained (2017) dol...",2023M12,Chained Dollars,Percent change,0,0.2,T20600
33405,T20600,A067RM,43,"Disposable personal income, chained (2017) dol...",2024M01,Chained Dollars,Percent change,0,0.0,T20600

#### This dataset starts in 1959 which is does not reach back to 1948. I found a dataset that is not chained (adjust) to 2017 dollars. This dataset will not be used.

#### Employment Level will be loaded next to check for suitability.

In [15]:
# Read data from The Bureau of Labor Statistics
# Employment Level - Unadjusted - LNU02000000
cd_df = pd.read_csv('./data/Employment Data/Employment Level - Unadjusted - LNU02000000.csv')
cprt(cd_df)

'Shape: (914, 4)'

Head

     Series ID  Year Period  Value
0  LNU02000000  1948    M01  56339
1  LNU02000000  1948    M02  56440
2  LNU02000000  1948    M03  56601
3  LNU02000000  1948    M04  57471
4  LNU02000000  1948    M05  57763

Tail

       Series ID  Year Period   Value
909  LNU02000000  2023    M10  161676
910  LNU02000000  2023    M11  162149
911  LNU02000000  2023    M12  160754
912  LNU02000000  2024    M01  159650
913  LNU02000000  2024    M02  160315

#### Employment Level includes full time and part time employment.  The dataset frequency is monthly.  The dataset starts in year 1948. Employment data may be a leading indicator in a recovery.  This dataset will be used.

#### Employment data is stored to the database for later use.

In [16]:
# Store each dataframe in the data base capstone with the table name listed in the call.
cd_df.to_sql(con=db_engine, name='employment_level', if_exists='replace', index=False)

914

#### Full Time Employment will be loaded next to check for suitability.

In [17]:
#Employed - Usually Work Full Time - Unadjusted - LNU02500000
cd_df = pd.read_csv('./data/Employment Data/Employed - Usually Work Full Time - Unadjusted - LNU02500000.csv')
cprt(cd_df)

'Shape: (674, 4)'

Head

     Series ID  Year Period  Value
0  LNU02500000  1968    M01  63085
1  LNU02500000  1968    M02  63258
2  LNU02500000  1968    M03  63602
3  LNU02500000  1968    M04  64104
4  LNU02500000  1968    M05  64356

Tail

       Series ID  Year Period   Value
669  LNU02500000  2023    M10  134824
670  LNU02500000  2023    M11  134634
671  LNU02500000  2023    M12  132585
672  LNU02500000  2024    M01  131549
673  LNU02500000  2024    M02  131815

#### Full Time Employment frequency is monthly.  The dataset starts in year 1968. As it is 20 years after 1948 and is likely corelate (redundant) to Employment Level it will not be used.

#### Full Time Employment data is stored to the database for later use.

In [ ]:
# Store each dataframe in the data base capstone with the table name listed in the call.
cd_df.to_sql(con=db_engine, name='employment_full_time', if_exists='replace', index=False)

#### Full Time Employment will be loaded next to check for suitability.

In [18]:
#Unemployed - Unadjusted - LNU03000000
cd_df = pd.read_csv('./data/Employment Data/Unemployment Level - Unadjusted - LNU03000000.csv')
cprt(cd_df)

'Shape: (914, 4)'

Head

     Series ID  Year Period  Value
0  LNU03000000  1948    M01   2351
1  LNU03000000  1948    M02   2807
2  LNU03000000  1948    M03   2646
3  LNU03000000  1948    M04   2407
4  LNU03000000  1948    M05   2014

Tail

       Series ID  Year Period  Value
909  LNU03000000  2023    M10   6098
910  LNU03000000  2023    M11   5827
911  LNU03000000  2023    M12   5907
912  LNU03000000  2024    M01   6778
913  LNU03000000  2024    M02   6970

#### Unemployment Level frequency is monthly and starts in the year 1948.  This data will be used but must be tested for corelation with Employment Level.

In [ ]:
# Store each dataframe in the data base capstone with the table name listed in the call.
cd_df.to_sql(con=db_engine, name='unemployment', if_exists='replace', index=False)

#### Full Time Employment data is stored to the database for later use.

#### Government Spending will be loaded next to check for suitability.

In [20]:
load_sql = 'SELECT * FROM capstone.government_expenditures WHERE LineNumber = 21 ORDER BY TimePeriod ASC'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (308, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,T30100,A955RC,21,Consumption expenditures,1947Q1,Current Dollars,Level,6,35326,T30100
1,T30100,A955RC,21,Consumption expenditures,1947Q2,Current Dollars,Level,6,35020,T30100
2,T30100,A955RC,21,Consumption expenditures,1947Q3,Current Dollars,Level,6,33269,T30100
3,T30100,A955RC,21,Consumption expenditures,1947Q4,Current Dollars,Level,6,32949,T30100
4,T30100,A955RC,21,Consumption expenditures,1948Q1,Current Dollars,Level,6,33338,T30100

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
303,T30100,A955RC,21,Consumption expenditures,2022Q4,Current Dollars,Level,6,3654444,T30100
304,T30100,A955RC,21,Consumption expenditures,2023Q1,Current Dollars,Level,6,3702073,T30100
305,T30100,A955RC,21,Consumption expenditures,2023Q2,Current Dollars,Level,6,3695458,T30100
306,T30100,A955RC,21,Consumption expenditures,2023Q3,Current Dollars,Level,6,3790156,T30100
307,T30100,A955RC,21,Consumption expenditures,2023Q4,Current Dollars,Level,6,3820950,T30100

#### Government Spending frequency is quarterly and the start year is 1948. This dataset will be used.

#### Mining Income will be loaded next to check for suitability.

In [19]:
load_sql = 'SELECT * FROM capstone.ni_by_industry WHERE LineDescription = "Mining" ORDER BY TimePeriod ASC'
cd_df = pd.read_sql(sql=load_sql, con=db_engine)
cprt(cd_df)

'Shape: (307, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,T60100B,J734RC,5,Mining,1948Q1,Current Dollars,Level,6,5537,T60100B
1,T60100B,J734RC,5,Mining,1948Q2,Current Dollars,Level,6,5560,T60100B
2,T60100B,J734RC,5,Mining,1948Q3,Current Dollars,Level,6,6112,T60100B
3,T60100B,J734RC,5,Mining,1948Q4,Current Dollars,Level,6,6047,T60100B
4,T60100B,J734RC,5,Mining,1949Q1,Current Dollars,Level,6,5660,T60100B

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
302,T60100D,N5005C,5,Mining,2022Q3,Current Dollars,Level,6,383968,T60100D
303,T60100D,N5005C,5,Mining,2022Q4,Current Dollars,Level,6,321653,T60100D
304,T60100D,N5005C,5,Mining,2023Q1,Current Dollars,Level,6,304261,T60100D
305,T60100D,N5005C,5,Mining,2023Q2,Current Dollars,Level,6,267145,T60100D
306,T60100D,N5005C,5,Mining,2023Q3,Current Dollars,Level,6,280884,T60100D

#### The Mining dataset frequency is monthly and starts in the year 1948.  This dataset will be used.

### The following datasets will be loaded and I will align and drop all the features that are not required.

| Usable Dataset | Time Alignment | Starting Year | SQL for Load |
|-|-|-|-|
| Household Assets | Quarterly | 1952 | SELECT * FROM capstone.household_assets |
| Employment Level | Monthly | 1948 | SELECT * FROM capstone.employment_level |
| Unemployment Level | Monthly | 1948 | SELECT * FROM capstone.unemployment |
| US Government Spending | Quarterly | 1947 | SELECT * FROM capstone.government_expenditures WHERE LineNumber = 21 ORDER BY TimePeriod ASC |
| Mining Income | Quarterly | 1948 | SELECT * FROM capstone.ni_by_industry WHERE LineDescription = "Mining" ORDER BY TimePeriod ASC |

In [38]:
load_sql = 'SELECT * FROM capstone.employment_level'
el_df = pd.read_sql(sql=load_sql, con=db_engine)
# sanity check
cprt(el_df)

'Shape: (914, 4)'

Head

     Series ID  Year Period  Value
0  LNU02000000  1948    M01  56339
1  LNU02000000  1948    M02  56440
2  LNU02000000  1948    M03  56601
3  LNU02000000  1948    M04  57471
4  LNU02000000  1948    M05  57763

Tail

       Series ID  Year Period   Value
909  LNU02000000  2023    M10  161676
910  LNU02000000  2023    M11  162149
911  LNU02000000  2023    M12  160754
912  LNU02000000  2024    M01  159650
913  LNU02000000  2024    M02  160315

#### Correct date to pandas datetime

In [39]:
# Correct the format and convert Year and Period to datetime
el_df["Date"] = pd.to_datetime(el_df["Year"].astype(str) + el_df["Period"].str.replace('M', ''), format="%Y%m")

# Display the updated dataframe
el_df.head()

     Series ID  Year Period  Value       Date
0  LNU02000000  1948    M01  56339 1948-01-01
1  LNU02000000  1948    M02  56440 1948-02-01
2  LNU02000000  1948    M03  56601 1948-03-01
3  LNU02000000  1948    M04  57471 1948-04-01
4  LNU02000000  1948    M05  57763 1948-05-01

#### Drop Series ID, Year, Period. Rename Values to employment_level_in_millions. Then perform a sanity check.

In [40]:
el_df = el_df.drop(columns={'Series ID', 'Year', 'Period'})
el_df.rename(columns={'Value' : 'employment_level_in_millions'}, inplace=True)
el_df.head()

   employment_level_in_millions       Date
0                         56339 1948-01-01
1                         56440 1948-02-01
2                         56601 1948-03-01
3                         57471 1948-04-01
4                         57763 1948-05-01

#### Make the date column the index and perform a sanity check.

In [34]:
# el_df.set_index('Date', inplace=True)
# el_df.head()

            employment_level_in_millions
Date
1948-01-01                         56339
1948-02-01                         56440
1948-03-01                         56601
1948-04-01                         57471
1948-05-01                         57763

#### Load Unemployment Level from the database

In [41]:
load_sql = 'SELECT * FROM capstone.unemployment'
unel_df = pd.read_sql(sql=load_sql, con=db_engine)
# sanity check
cprt(unel_df)

'Shape: (914, 4)'

Head

     Series ID  Year Period  Value
0  LNU03000000  1948    M01   2351
1  LNU03000000  1948    M02   2807
2  LNU03000000  1948    M03   2646
3  LNU03000000  1948    M04   2407
4  LNU03000000  1948    M05   2014

Tail

       Series ID  Year Period  Value
909  LNU03000000  2023    M10   6098
910  LNU03000000  2023    M11   5827
911  LNU03000000  2023    M12   5907
912  LNU03000000  2024    M01   6778
913  LNU03000000  2024    M02   6970

#### Add Unemployment Level data to employment dataset and label column unemployment_level_in_millions.

In [42]:
el_df['unemployment_level_in_millions'] = unel_df['Value']
cprt(el_df)

'Shape: (914, 3)'

Head

   employment_level_in_millions       Date  unemployment_level_in_millions
0                         56339 1948-01-01                            2351
1                         56440 1948-02-01                            2807
2                         56601 1948-03-01                            2646
3                         57471 1948-04-01                            2407
4                         57763 1948-05-01                            2014

Tail

     employment_level_in_millions       Date  unemployment_level_in_millions
909                        161676 2023-10-01                            6098
910                        162149 2023-11-01                            5827
911                        160754 2023-12-01                            5907
912                        159650 2024-01-01                            6778
913                        160315 2024-02-01                            6970

#### Load Government expenditures from the database.

In [58]:
load_sql = 'SELECT * FROM capstone.government_expenditures WHERE LineNumber = 21 ORDER BY TimePeriod ASC'
us_spend_df = pd.read_sql(sql=load_sql, con=db_engine)
# sanity check
cprt(us_spend_df)

'Shape: (308, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,T30100,A955RC,21,Consumption expenditures,1947Q1,Current Dollars,Level,6,35326,T30100
1,T30100,A955RC,21,Consumption expenditures,1947Q2,Current Dollars,Level,6,35020,T30100
2,T30100,A955RC,21,Consumption expenditures,1947Q3,Current Dollars,Level,6,33269,T30100
3,T30100,A955RC,21,Consumption expenditures,1947Q4,Current Dollars,Level,6,32949,T30100
4,T30100,A955RC,21,Consumption expenditures,1948Q1,Current Dollars,Level,6,33338,T30100

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
303,T30100,A955RC,21,Consumption expenditures,2022Q4,Current Dollars,Level,6,3654444,T30100
304,T30100,A955RC,21,Consumption expenditures,2023Q1,Current Dollars,Level,6,3702073,T30100
305,T30100,A955RC,21,Consumption expenditures,2023Q2,Current Dollars,Level,6,3695458,T30100
306,T30100,A955RC,21,Consumption expenditures,2023Q3,Current Dollars,Level,6,3790156,T30100
307,T30100,A955RC,21,Consumption expenditures,2023Q4,Current Dollars,Level,6,3820950,T30100

#### Drop rows 0, 1, 2, and 3 from 1947.  Perform a sanity check.

In [59]:
us_spend_df.drop(us_spend_df.index[[0,1,2,3]], inplace=True)
cprt(us_spend_df)

'Shape: (304, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
4,T30100,A955RC,21,Consumption expenditures,1948Q1,Current Dollars,Level,6,33338,T30100
5,T30100,A955RC,21,Consumption expenditures,1948Q2,Current Dollars,Level,6,34638,T30100
6,T30100,A955RC,21,Consumption expenditures,1948Q3,Current Dollars,Level,6,35881,T30100
7,T30100,A955RC,21,Consumption expenditures,1948Q4,Current Dollars,Level,6,37237,T30100
8,T30100,A955RC,21,Consumption expenditures,1949Q1,Current Dollars,Level,6,38333,T30100

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
303,T30100,A955RC,21,Consumption expenditures,2022Q4,Current Dollars,Level,6,3654444,T30100
304,T30100,A955RC,21,Consumption expenditures,2023Q1,Current Dollars,Level,6,3702073,T30100
305,T30100,A955RC,21,Consumption expenditures,2023Q2,Current Dollars,Level,6,3695458,T30100
306,T30100,A955RC,21,Consumption expenditures,2023Q3,Current Dollars,Level,6,3790156,T30100
307,T30100,A955RC,21,Consumption expenditures,2023Q4,Current Dollars,Level,6,3820950,T30100

#### Correct time column, add monthly rows, and interpolate NAN values with the linear method.

In [60]:
# Convert 'TimePeriod' to datetime at the quarter's start
us_spend_df['TimePeriod'] = pd.PeriodIndex(us_spend_df['TimePeriod'], freq='Q').to_timestamp()

# Generate a full range of monthly dates between the min and max of 'TimePeriod'
full_range = pd.date_range(start=us_spend_df['TimePeriod'].min(), end='2024-02-01', freq='MS')

# Create a new DataFrame with this full range
df_full = pd.DataFrame(full_range, columns=['TimePeriod'])

# Merge the original DataFrame with the full range DataFrame
df_expanded = pd.merge(df_full, us_spend_df, on='TimePeriod', how='left')

# Fill in Nan values
df_expanded['DataValue'] = df_expanded['DataValue'].interpolate(method='linear')

cprt(df_expanded)

'Shape: (914, 10)'

Head

,TimePeriod,TableName,SeriesCode,LineNumber,LineDescription,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,1948-01-01,T30100,A955RC,21.0,Consumption expenditures,Current Dollars,Level,6.0,33338.000000,T30100
1,1948-02-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,33771.333333,NaN
2,1948-03-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,34204.666667,NaN
3,1948-04-01,T30100,A955RC,21.0,Consumption expenditures,Current Dollars,Level,6.0,34638.000000,T30100
4,1948-05-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35052.333333,NaN

Tail

,TimePeriod,TableName,SeriesCode,LineNumber,LineDescription,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
909,2023-10-01,T30100,A955RC,21.0,Consumption expenditures,Current Dollars,Level,6.0,3820950.0,T30100
910,2023-11-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3820950.0,NaN
911,2023-12-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3820950.0,NaN
912,2024-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3820950.0,NaN
913,2024-02-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3820950.0,NaN

#### Add the government spending to the dataframe and name the column us_spend_in_millions.

In [61]:
el_df['us_spend_in_millions'] = df_expanded['DataValue']

In [62]:
# Sanity check.
cprt(el_df)

'Shape: (914, 4)'

Head

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions
0,56339,1948-01-01,2351,33338.000000
1,56440,1948-02-01,2807,33771.333333
2,56601,1948-03-01,2646,34204.666667
3,57471,1948-04-01,2407,34638.000000
4,57763,1948-05-01,2014,35052.333333

Tail

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions
909,161676,2023-10-01,6098,3820950.0
910,162149,2023-11-01,5827,3820950.0
911,160754,2023-12-01,5907,3820950.0
912,159650,2024-01-01,6778,3820950.0
913,160315,2024-02-01,6970,3820950.0

#### Load Mining Income from the data base.

In [77]:
load_sql = 'SELECT * FROM capstone.ni_by_industry WHERE LineDescription = "Mining" ORDER BY TimePeriod ASC'
mining_income_df = pd.read_sql(sql=load_sql, con=db_engine)
# sanity check
cprt(mining_income_df)

'Shape: (307, 10)'

Head

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,T60100B,J734RC,5,Mining,1948Q1,Current Dollars,Level,6,5537,T60100B
1,T60100B,J734RC,5,Mining,1948Q2,Current Dollars,Level,6,5560,T60100B
2,T60100B,J734RC,5,Mining,1948Q3,Current Dollars,Level,6,6112,T60100B
3,T60100B,J734RC,5,Mining,1948Q4,Current Dollars,Level,6,6047,T60100B
4,T60100B,J734RC,5,Mining,1949Q1,Current Dollars,Level,6,5660,T60100B

Tail

,TableName,SeriesCode,LineNumber,LineDescription,TimePeriod,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
302,T60100D,N5005C,5,Mining,2022Q3,Current Dollars,Level,6,383968,T60100D
303,T60100D,N5005C,5,Mining,2022Q4,Current Dollars,Level,6,321653,T60100D
304,T60100D,N5005C,5,Mining,2023Q1,Current Dollars,Level,6,304261,T60100D
305,T60100D,N5005C,5,Mining,2023Q2,Current Dollars,Level,6,267145,T60100D
306,T60100D,N5005C,5,Mining,2023Q3,Current Dollars,Level,6,280884,T60100D

#### The Mining Income is in three tables from the BEA. The merging of the tables caused an overlap of year 1987.  The drop corrects the problem by removing the older data.  Next, I correct the time, add in the missing date rows, and interpolate using the linear method.

In [78]:

# The table is made up of 3 tables from the BEA. Two of the tables have some overlapping data
# that I remove here.
mining_income_df.drop(mining_income_df.index[[156, 158, 160, 162]], inplace=True)

# Convert 'TimePeriod' to datetime at the quarter's start
mining_income_df['TimePeriod'] = pd.PeriodIndex(mining_income_df['TimePeriod'], freq='Q').to_timestamp()

# Generate a full range of monthly dates between the min and max of 'TimePeriod'
full_range = pd.date_range(start=mining_income_df['TimePeriod'].min(), end='2024-02-01', freq='MS')

# Create a new DataFrame with this full range
df_full = pd.DataFrame(full_range, columns=['TimePeriod'])

# Merge the original DataFrame with the full range DataFrame
df_expanded = pd.merge(df_full, mining_income_df, on='TimePeriod', how='left')

# Fill in Nan values
df_expanded['DataValue'] = df_expanded['DataValue'].interpolate(method='linear')

# Sanity check.
cprt(df_expanded)

'Shape: (914, 10)'

Head

,TimePeriod,TableName,SeriesCode,LineNumber,LineDescription,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
0,1948-01-01,T60100B,J734RC,5.0,Mining,Current Dollars,Level,6.0,5537.000000,T60100B
1,1948-02-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5544.666667,NaN
2,1948-03-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5552.333333,NaN
3,1948-04-01,T60100B,J734RC,5.0,Mining,Current Dollars,Level,6.0,5560.000000,T60100B
4,1948-05-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5744.000000,NaN

Tail

,TimePeriod,TableName,SeriesCode,LineNumber,LineDescription,METRIC_NAME,CL_UNIT,UNIT_MULT,DataValue,NoteRef
909,2023-10-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,280884.0,NaN
910,2023-11-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,280884.0,NaN
911,2023-12-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,280884.0,NaN
912,2024-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,280884.0,NaN
913,2024-02-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,280884.0,NaN

#### Add the Mining Income data to the dataframe and name the column mining_income_in_millions.

In [79]:
el_df['mining_income_in_millions'] = df_expanded['DataValue']
cprt(el_df)

'Shape: (914, 5)'

Head

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions
0,56339,1948-01-01,2351,33338.000000,5537.000000
1,56440,1948-02-01,2807,33771.333333,5544.666667
2,56601,1948-03-01,2646,34204.666667,5552.333333
3,57471,1948-04-01,2407,34638.000000,5560.000000
4,57763,1948-05-01,2014,35052.333333,5744.000000

Tail

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions
909,161676,2023-10-01,6098,3820950.0,280884.0
910,162149,2023-11-01,5827,3820950.0,280884.0
911,160754,2023-12-01,5907,3820950.0,280884.0
912,159650,2024-01-01,6778,3820950.0,280884.0
913,160315,2024-02-01,6970,3820950.0,280884.0

#### Load Household Assets from the database.

In [81]:
load_sql = 'SELECT * FROM capstone.household_assets ORDER BY datetime ASC'
hh_assets_df = pd.read_sql(sql=load_sql, con=db_engine)
# sanity check
cprt(hh_assets_df)

'Shape: (286, 6)'

Head

,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter,datetime
0,1298464,533.45,1384688,568.88,Q1,1952-03-31
1,1321033,536.03,1411444,572.72,Q2,1952-06-30
2,1334038,527.17,1427479,564.09,Q3,1952-09-30
3,1338242,516.89,1436132,554.70,Q4,1952-12-03
4,1348617,512.84,1448824,550.95,Q1,1953-03-31

Tail

,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter,datetime
281,146312369,790.80,165688078,895.52,Q2,2022-06-30
282,142823794,756.41,162526658,860.76,Q3,2022-09-30
283,143655328,749.05,163579607,852.94,Q4,2022-12-03
284,146639645,737.62,166598374,838.01,Q1,2023-03-31
285,152300438,755.30,172427752,855.12,Q2,2023-06-30

#### Correct the datetime column and add monthly rows to match the dataframe.  Fill in the NA data using the interpolate linear method.

#### Correct the datetime column and adds the missing rows for monthly. The NAN data is backfilled using interpolate linear method.

In [84]:
# Convert 'datetime' to datetime at the quarter's start
hh_assets_df['datetime'] = pd.PeriodIndex(hh_assets_df['datetime'], freq='Q').to_timestamp()

# Generate a full range of monthly dates between the min and max of 'datetimed'
full_range = pd.date_range(start='1948-01-01', end='2024-02-01', freq='MS')

# Create a new DataFrame with this full range
df_full = pd.DataFrame(full_range, columns=['datetime'])

# Merge the original DataFrame with the full range DataFrame
df_expanded = pd.merge(df_full, hh_assets_df, on='datetime', how='left')

# Fill in Nan values
df_expanded['Net_Worth_In_Millions'] = df_expanded['Net_Worth_In_Millions'].interpolate(method='linear')
df_expanded['Net_Worth/DPI'] = df_expanded['Net_Worth/DPI'].interpolate(method='linear')
df_expanded['Total_Assets_In_Millions'] = df_expanded['Total_Assets_In_Millions'].interpolate(method='linear')
df_expanded['Total_Assets/DPI'] = df_expanded['Total_Assets/DPI'].interpolate(method='linear')

cprt(df_expanded)

'Shape: (914, 6)'

Head

,datetime,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter
0,1948-01-01,NaN,NaN,NaN,NaN,NaN
1,1948-02-01,NaN,NaN,NaN,NaN,NaN
2,1948-03-01,NaN,NaN,NaN,NaN,NaN
3,1948-04-01,NaN,NaN,NaN,NaN,NaN
4,1948-05-01,NaN,NaN,NaN,NaN,NaN

Tail

,datetime,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter
909,2023-10-01,152300438.0,755.3,172427752.0,855.12,NaN
910,2023-11-01,152300438.0,755.3,172427752.0,855.12,NaN
911,2023-12-01,152300438.0,755.3,172427752.0,855.12,NaN
912,2024-01-01,152300438.0,755.3,172427752.0,855.12,NaN
913,2024-02-01,152300438.0,755.3,172427752.0,855.12,NaN

#### The dataset starts in the year of 1952 and the dataframe starts in the year 1948.  This code back fills the dates from 1948 to 1952 using the data from 1952.

In [93]:
# Find first value in 1952
i = 0
while pd.isna(df_expanded.iloc[i,4]):    
    i += 1
display(df_expanded.iloc[i,4])

# Store the value from each column from 1952.
start = []
start.append(df_expanded.iloc[i,1])
start.append(df_expanded.iloc[i,2])
start.append(df_expanded.iloc[i,3])
start.append(df_expanded.iloc[i,4])

# Back fill the data from 1952 to 1948
i -=1
while i > -1:
    df_expanded.iloc[i,1] = start[0]
    df_expanded.iloc[i,2] = start[1]
    df_expanded.iloc[i,3] = start[2]
    df_expanded.iloc[i,4] = start[3]
    i -= 1

# Sanity check.
cprt(df_expanded)

568.88

'Shape: (914, 6)'

Head

,datetime,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter
0,1948-01-01,1298464.0,533.45,1384688.0,568.88,NaN
1,1948-02-01,1298464.0,533.45,1384688.0,568.88,NaN
2,1948-03-01,1298464.0,533.45,1384688.0,568.88,NaN
3,1948-04-01,1298464.0,533.45,1384688.0,568.88,NaN
4,1948-05-01,1298464.0,533.45,1384688.0,568.88,NaN

Tail

,datetime,Net_Worth_In_Millions,Net_Worth/DPI,Total_Assets_In_Millions,Total_Assets/DPI,quarter
909,2023-10-01,152300438.0,755.3,172427752.0,855.12,NaN
910,2023-11-01,152300438.0,755.3,172427752.0,855.12,NaN
911,2023-12-01,152300438.0,755.3,172427752.0,855.12,NaN
912,2024-01-01,152300438.0,755.3,172427752.0,855.12,NaN
913,2024-02-01,152300438.0,755.3,172427752.0,855.12,NaN

#### Add columns from Household Assets to dataframe.

In [94]:
el_df['hha_net_worth_in_millions'] = df_expanded['Net_Worth_In_Millions']
el_df['hha_net_worth/dpi'] = df_expanded['Net_Worth/DPI']
el_df['hha_total_assets_in_millions'] = df_expanded['Total_Assets_In_Millions']
el_df['hha_total_assets/dpi'] = df_expanded['Total_Assets/DPI']

In [95]:
# Sanity check.
cprt(el_df)

'Shape: (914, 9)'

Head

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi
0,56339,1948-01-01,2351,33338.000000,5537.000000,1298464.0,533.45,1384688.0,568.88
1,56440,1948-02-01,2807,33771.333333,5544.666667,1298464.0,533.45,1384688.0,568.88
2,56601,1948-03-01,2646,34204.666667,5552.333333,1298464.0,533.45,1384688.0,568.88
3,57471,1948-04-01,2407,34638.000000,5560.000000,1298464.0,533.45,1384688.0,568.88
4,57763,1948-05-01,2014,35052.333333,5744.000000,1298464.0,533.45,1384688.0,568.88

Tail

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi
909,161676,2023-10-01,6098,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12
910,162149,2023-11-01,5827,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12
911,160754,2023-12-01,5907,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12
912,159650,2024-01-01,6778,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12
913,160315,2024-02-01,6970,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12

#### Load the dependent variable.

In [96]:
# Load Y values
y_df = pd.read_csv('data/y_var.csv')
y_df.head()

,Year,Month,NBER - Wiki List of Recessions,Market Related,Event Related,Unnamed: 5,Unnamed: 6
0,1948,1,0,0,0,NaN,NaN
1,1948,2,0,0,0,NaN,NaN
2,1948,3,0,0,0,NaN,NaN
3,1948,4,0,0,0,NaN,NaN
4,1948,5,0,0,0,NaN,NaN

#### Drop empty columns.

In [98]:
y_df.drop(columns={'Unnamed: 5', 'Unnamed: 6'}, inplace=True)
y_df.head()

   Year  Month  NBER - Wiki List of Recessions  Market Related  Event Related
0  1948      1                               0               0              0
1  1948      2                               0               0              0
2  1948      3                               0               0              0
3  1948      4                               0               0              0
4  1948      5                               0               0              0

In [99]:
y_df.shape

(914, 5)

#### The shape matches the dataframe so it is safe to add the dependent variable.  The column for the dependent variable in the dataframe is downturn.

In [100]:
el_df['downturn'] = y_df['NBER - Wiki List of Recessions']
el_df

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi,downturn
0,56339,1948-01-01,2351,3.333800e+04,5537.000000,1298464.0,533.45,1384688.0,568.88,0
1,56440,1948-02-01,2807,3.377133e+04,5544.666667,1298464.0,533.45,1384688.0,568.88,0
2,56601,1948-03-01,2646,3.420467e+04,5552.333333,1298464.0,533.45,1384688.0,568.88,0
3,57471,1948-04-01,2407,3.463800e+04,5560.000000,1298464.0,533.45,1384688.0,568.88,0
4,57763,1948-05-01,2014,3.505233e+04,5744.000000,1298464.0,533.45,1384688.0,568.88,0
...,...,...,...,...,...,...,...,...,...,...
909,161676,2023-10-01,6098,3.820950e+06,280884.000000,152300438.0,755.30,172427752.0,855.12,0
910,162149,2023-11-01,5827,3.820950e+06,280884.000000,152300438.0,755.30,172427752.0,855.12,0
911,160754,2023-12-01,5907,3.820950e+06,280884.000000,152300438.0,755.30,172427752.0,855.12,0
912,159650,2024-01-01,6778,3.820950e+06,280884.000000,152300438.0,755.30,172427752.0,855.12,0
913,160315,2024-02-01,6970,3.820950e+06,280884.000000,152300438.0,755.30,172427752.0,855.12,0

##### Save check point

In [101]:
# Save checkpoint.
# el_df.to_csv('data/capstone_dataset.csv')

#### Load from check point

In [9]:
cap_df = pd.read_csv('data/capstone_dataset.csv', index_col=None)
cap_df.drop(columns={'Unnamed: 0'}, inplace=True)
cprt(cap_df)

'Shape: (914, 10)'

Head

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi,downturn
0,56339,1948-01-01,2351,33338.000000,5537.000000,1298464.0,533.45,1384688.0,568.88,0
1,56440,1948-02-01,2807,33771.333333,5544.666667,1298464.0,533.45,1384688.0,568.88,0
2,56601,1948-03-01,2646,34204.666667,5552.333333,1298464.0,533.45,1384688.0,568.88,0
3,57471,1948-04-01,2407,34638.000000,5560.000000,1298464.0,533.45,1384688.0,568.88,0
4,57763,1948-05-01,2014,35052.333333,5744.000000,1298464.0,533.45,1384688.0,568.88,0

Tail

,employment_level_in_millions,Date,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi,downturn
909,161676,2023-10-01,6098,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12,0
910,162149,2023-11-01,5827,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12,0
911,160754,2023-12-01,5907,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12,0
912,159650,2024-01-01,6778,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12,0
913,160315,2024-02-01,6970,3820950.0,280884.0,152300438.0,755.3,172427752.0,855.12,0

In [10]:
# Make the date column the index
cap_df.set_index('Date', inplace=True)

# Sanity check.
cap_df.head()

,employment_level_in_millions,unemployment_level_in_millions,us_spend_in_millions,mining_income_in_millions,hha_net_worth_in_millions,hha_net_worth/dpi,hha_total_assets_in_millions,hha_total_assets/dpi,downturn
Date,,,,,,,,,
1948-01-01,56339,2351,33338.000000,5537.000000,1298464.0,533.45,1384688.0,568.88,0
1948-02-01,56440,2807,33771.333333,5544.666667,1298464.0,533.45,1384688.0,568.88,0
1948-03-01,56601,2646,34204.666667,5552.333333,1298464.0,533.45,1384688.0,568.88,0
1948-04-01,57471,2407,34638.000000,5560.000000,1298464.0,533.45,1384688.0,568.88,0
1948-05-01,57763,2014,35052.333333,5744.000000,1298464.0,533.45,1384688.0,568.88,0